{
  "list": [
    {
      "name": "auto-armor",
      "header": "Авто Доспехи",
      "description": [
        "Плагин «Авто Доспехи» автоматически экипирует боту лучшую доступную броню из инвентаря. Он поддерживает все типы доспехов: шлемы, нагрудники, поножи и ботинки.",
        "Система оценки брони основана на внутреннем приоритете материалов: кожаная < золотая < кольчужная < медная < железная < алмазная < незеритовая. Бот всегда выберет самый защищённый вариант, если он лучше текущего.",
        "Если слот для нужной части брони уже занят, плагин временно переместит старую броню в свободное место инвентаря, чтобы надеть новую. При отсутствии свободного места экипировка не произойдёт."
      ],
      "latest-update": "23.01.2026"
    },
    {
      "name": "auto-totem",
      "header": "Авто Тотем",
      "description": [
        "Плагин «Авто Тотем» следит за тем, чтобы в off-hand (слот 45) всегда находился тотем бессмертия. Если слот пуст, а в инвентаре есть хотя бы один тотем — он будет немедленно перемещён туда.",
        "Это особенно полезно в боевых или опасных ситуациях, когда бот может умереть, но должен выжить благодаря автоматическому использованию тотема."
      ],
      "latest-update": "23.01.2026"
    },
    {
      "name": "auto-eat",
      "header": "Авто Еда",
      "description": [
        "Плагин «Авто Еда» позволяет боту автоматически есть пищу, когда уровень голода падает ниже 20 (максимум). Он не просто ест первую попавшуюся еду — он выбирает оптимальную по приоритету.",
        "Пища разделена на 4 категории: от 0 (низкая питательность, например, ягоды) до 3 (высокая, например, золотое яблоко или золотая морковь). Чем ниже здоровье или сытость бота, тем выше приоритет требуемой еды.",
        "Перед едой плагин перемещает выбранную еду в горячую панель (если её там нет), используя свободный слот или временно заменяя случайный предмет. Во время еды блокируется использование зелий, чтобы избежать конфликтов."
      ],
      "latest-update": "27.01.2026"
    },
    {
      "name": "auto-potion",
      "header": "Авто Зелье",
      "description": [
        "Плагин «Авто Зелье» автоматически даёт боту выпить зелье в зависимости от ситуации. Он активируется, когда здоровье бота падает ниже 20 сердец, но выбор зелья зависит от контекста."
      ],
      "latest-update": "27.01.2026"
    }
  ]
}